<?php include __DIR__ . '/../header.php'; ?>
<h2>Ларин Виталий Владимирович</h2>
    <h3>junior php - разработчик</h3>
    <p>Данный блог создан на PHP 7.2, реализованы/используются:</p>
    <lo>
        <li> архитетура MVC; </li>
        <li> пространства имен (namespaces), автозагрузка классов; </li>
        <li> БД Mysql 5.6; </li>
        <li> в работе с БД используется PDO и принцип ORM, реализованы операции CRUD; </li>
        <li> используются паттерны проектирования Active Record, Singleton;</li>
        <li> используется механизм Исключений(Exception);</li>
    </lo>
<?php include __DIR__ . '/../footer.php'; ?>